## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8024376372)



<pre><code>Error: POST https://api.github.com/repos/kyma-project/test-infra/actions/variables: 403 Resource not accessible by integration []

  with github_actions_variable.gcp_terraform_executor_service_account_email,
  on gcp-workfload-identity-federation.tf line 28, in resource &#34;github_actions_variable&#34; &#34;gcp_terraform_executor_service_account_email&#34;:
  28: resource &#34;github_actions_variable&#34; &#34;gcp_terraform_executor_service_account_email&#34; {


Error: POST https://api.github.com/repos/kyma-incubator/test-infra/actions/variables: 404 Not Found []

  with github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider,
  on gcp-workfload-identity-federation.tf line 35, in resource &#34;github_actions_variable&#34; &#34;gh_com_kyma_project_gcp_workload_identity_federation_provider&#34;:
  35: resource &#34;github_actions_variable&#34; &#34;gh_com_kyma_project_gcp_workload_identity_federation_provider&#34; {


Error: Error applying IAM policy for service account &#39;projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com&#39;: Error setting IAM policy for service account &#39;projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com&#39;: googleapi: Error 400: Invalid principalSet member (principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project-pool/subject/repository_id:147495537:repository_owner_id:39153523:workflow:pull-plan-prod-terraform)., badRequest

  with module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa[&#34;terraform_executor_pull_prod_plan&#34;],
  on .terraform/modules/gh_com_kyma_project_workload_identity_federation/modules/gh-oidc/main.tf line 41, in resource &#34;google_service_account_iam_member&#34; &#34;wif-sa&#34;:
  41: resource &#34;google_service_account_iam_member&#34; &#34;wif-sa&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.kubectl_file_documents.automated_approver: Reading...
data.kubectl_file_documents.automated_approver_rules: Reading...
data.kubectl_file_documents.automated_approver_rules: Read complete after 0s [id=19c34a2d52f016db7760167874f1dd600c43fd4c3393fc0e1a46bc2398211be8]
data.kubectl_file_documents.automated_approver: Read complete after 0s [id=7d972652e96cc80e5e53b48b526d2af1475ff0b327353810d789ce29c2d31dfe]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.security_dashboard_token.data.google_project.project: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Reading...
module.cors_proxy.data.google_project.project: Reading...
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 1s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
data.google_container_cluster.prow_k8s_cluster: Reading...
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
data.google_client_config.gcp: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
module.github_webhook_gateway.data.google_project.project: Reading...
module.cors_proxy.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.github_webhook_gateway.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
module.security_dashboard_token.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west1/services/security-dashboard-token]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
google_project_iam_member.service_account_keys_rotator_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/cors-proxy]
google_project_iam_member.service_account_keys_cleaner_workloads_project: Refreshing state... [id=sap-kyma-prow-workloads/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_sa_keys_admin: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secrets_versions_manager: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionManager/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secret_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project-pool]
module.service_account_keys_rotator.google_cloud_run_service_iam_member.service_account_keys_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_run_service_iam_member.service_account_keys_cleaner_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-cleaner/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.writer_service_account["kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-service-account-keys-rotator]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
kubectl_manifest.automated_approver["/api/v1/namespaces/default/services/automated-approver"]: Refreshing state... [id=/api/v1/namespaces/default/services/automated-approver]
kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]: Refreshing state... [id=/apis/apps/v1/namespaces/default/deployments/automated-approver]
kubectl_manifest.automated_approver_rules["/api/v1/namespaces/default/configmaps/automated-approver-rules"]: Refreshing state... [id=/api/v1/namespaces/default/configmaps/automated-approver-rules]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=e50de6cd8b3d11489bad14b87ac5c305505c8ac8753f18797b8b9f540973419a]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=aae2dab5bbe26732309bd447018f20acae970f9214f19b4c95924e5a4fbb41aa]
kubernetes_network_policy.prow_allow_http_events: Refreshing state... [id=default/prow-allow-http-events]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
kubernetes_network_policy.prow_cluster_default: Refreshing state... [id=default/prow-cluster-default-network-policy]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=e50de6cd8b3d11489bad14b87ac5c305505c8ac8753f18797b8b9f540973419a]
kubernetes_network_policy.hook_to_plugins: Refreshing state... [id=default/hook-to-plugins-network-policy]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Read complete after 0s [id=4a5d7910a747fc74ce246af976c2ee4cf24807265fe5761b9c22e56a884cb776]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project-pool/providers/github-com-kyma-project-provider]
kubernetes_network_policy.untrusted_cluster_default: Refreshing state... [id=default/untrusted-cluster-default-network-policy]
kubernetes_cluster_role.access_signify_secrets_untrusted_workloads: Refreshing state... [id=access-signify-secrets]
kubernetes_cluster_role.access_kyma_bot_github_tokens_untrusted_workloads: Refreshing state... [id=access-kyma-bot-github-tokens]
module.slack_message_sender.google_eventarc_trigger.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/lo

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + effective_labels            = (known after apply)
      + enable_object_retention     = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = (known after apply)
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service" "gcs_bucket_mover" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover"
        name                       = "gcs-bucket-mover"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20240223-1cf33f35" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/move-gcs-bucket:v20240223-c10674d7"
                    # (2 unchanged attributes hidden)

                    # (9 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service" "github_issue_finder" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder"
        name                       = "github-issue-finder"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20240223-1cf33f35" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/search-github-issue:v20240223-c10674d7"
                    # (2 unchanged attributes hidden)

                    # (11 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service" "secrets_leak_log_scanner" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner"
        name                       = "secrets-leak-log-scanner"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20240223-1cf33f35" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/scan-logs-for-secrets:v20240223-c10674d7"
                    # (2 unchanged attributes hidden)

                    # (7 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer must be replaced
-/+ resource "google_project_iam_member" "project_log_writer" {
      ~ etag    = "BwYR6cD+aTQ=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker must be replaced
-/+ resource "google_project_iam_member" "project_workflows_invoker" {
      ~ etag    = "BwYR6cD+aTQ=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.slack_message_sender.google_cloud_run_service.slack_message_sender will be updated in-place
  ~ resource "google_cloud_run_service" "slack_message_sender" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender"
        name                       = "slack-message-sender"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20240221-01ff238c" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20240223-c10674d7"
                    # (2 unchanged attributes hidden)

                    # (12 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 13 to change, 2 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-02-23T15:08:14.926452Z" -> "2024-02-23T16:31:42.346116Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Destroying... [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Destroying... [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.gcp_terraform_executor_service_account_email: Creating...
module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa["terraform_executor_pull_prod_plan"]: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifying... [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.cors_proxy.google_cloud_run_service.cors_proxy: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider: Creating...
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifying... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]: Modifying... [id=/apis/apps/v1/namespaces/default/deployments/automated-approver]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Modifications complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifications complete after 2s [id=projects/kyma-project/locations/europe/repositories/modules-internal]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Destruction complete after 8s
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Destruction complete after 8s
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
kubectl_manifest.automated_approver["/apis/apps/v1/namespaces/default/deployments/automated-approver"]: Modifications complete after 9s [id=/apis/apps/v1/namespaces/default/deployments/automated-approver]
module.cors_proxy.google_cloud_run_service.cors_proxy: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy, 10s elapsed]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway, 10s elapsed]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Modifications complete after 18s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender, 10s elapsed]
module.cors_proxy.google_cloud_run_service.cors_proxy: Modifications complete after 19s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Modifications complete after 16s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Reading...
module.secrets_leaks_log_scanner.data.google_project.project: Reading...
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Reading...
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Read complete after 0s [id=735823064]
module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder]
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Read complete after 0s [id=kyma-prow-logs]
module.secrets_leaks_log_scanner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Creating...
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Creating...
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Creation complete after 8s [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Creation complete after 8s [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner: Still modifying... [id=locations/europe-west3/namespaces/sap-k...prow/services/secrets-leak-log-scanner, 10s elapsed]
module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover, 10s elapsed]
module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder, 10s elapsed]
module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner: Modifications complete after 16s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder: Modifications complete after 17s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-issue-finder]
module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover, 20s elapsed]
module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover: Modifications complete after 27s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]

Error: POST https://api.github.com/repos/kyma-project/test-infra/actions/variables: 403 Resource not accessible by integration []

  with github_actions_variable.gcp_terraform_executor_service_account_email,
  on gcp-workfload-identity-federation.tf line 28, in resource "github_actions_variable" "gcp_terraform_executor_service_account_email":
  28: resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {


Error: POST https://api.github.com/repos/kyma-incubator/test-infra/actions/variables: 404 Not Found []

  with github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider,
  on gcp-workfload-identity-federation.tf line 35, in resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider":
  35: resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {


Error: Error applying IAM policy for service account 'projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com': Error setting IAM policy for service account 'projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com': googleapi: Error 400: Invalid principalSet member (principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project-pool/subject/repository_id:147495537:repository_owner_id:39153523:workflow:pull-plan-prod-terraform)., badRequest

  with module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa["terraform_executor_pull_prod_plan"],
  on .terraform/modules/gh_com_kyma_project_workload_identity_federation/modules/gh-oidc/main.tf line 41, in resource "google_service_account_iam_member" "wif-sa":
  41: resource "google_service_account_iam_member" "wif-sa" {


```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":9960,"Program":"tfcmt","SHA1":"13bf97f0f5873a14ef4b1a44cc9082605e19e403","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->